Repository: actupro/yacs
Catalog: i18n/locale/*/codes.po
Languages: fr

source: Help index
fr: Index de l'aide

source: Formatting Codes
fr: Codes de contrôle

source: In-line formatting codes
fr: Formattage de caractères

source: Edited %s
fr: Mis à jour %s

source: On this page we are introducing some formatting codes and live examples of utilization.
fr: Cette page présente certains codes de contrôles ainsi que des exemples d'utilisation.

source: Wiki bold
fr: Mise en gras wiki

source: Example
fr: Exemple

source: Rendering
fr: Rendu

source: This is very **important**, isn't it?
fr: Ceci est très **important**, n'est-ce pas ?

source: Bold
fr: Mise en gras

source: This is very [b]important[/b], isn't it?
fr: Ceci est très [b]important[/b], n'est-ce pas ?

source: Wiki italics
fr: Italiques wiki

source: This is really //meaningful//!
fr: Ceci est //remarquable// !

source: Italics
fr: Italiques

source: This is really [i]meaningful[/i]!
fr: Ceci est [i]remarquable[/i] !

source: Wiki underline
fr: Soulignement wiki

source: I would like to __insist__ on this point...
fr: Je me permet d'__insister__ là-dessus...

source: Underlined
fr: Souligné

source: I would like to [u]insist[/u] on this point...
fr: Je me permet d'[u]insister[/u] là-dessus...

source: Wiki monospace
fr: Espacement fixe wiki

source: Type ##cwd ../foo/bar## to visit an interesting directory.
fr: Tapez ##cwd ../ici/là## pour visiter un répertoire intéressant.

source: Type [code]cwd ../foo/bar[/code] to visit an interesting directory.
fr: Tapez [code]cwd ../ici/là[/code] pour visiter un répertoire intéressant.

source: Color
fr: Couleur

source: Here is some text in [color=red]red[/color] and some text in [color=green]green[/color]
fr: Voici un texte en [color=red]rouge[/color] et un autre en [color=green]vert[/color]

source: Tiny
fr: Minuscule

source: This is really [tiny]tiny![/tiny]
fr: Ceci est [tiny]minuscule[/tiny] !

source: Small
fr: Petit

source: This is really [small]small![/small]
fr: Ceci est [small]petit[/small] !

source: Big
fr: Grand

source: This is really [big]meaningful[/big]
fr: Ceci est [big]remarquable[/big] !

source: Huge
fr: Géant

source: I would like to [huge]insist[/huge] on this point...
fr: Je me permet d'[huge]insister[/huge] là-dessus...

source: Superscript
fr: Exposant

source: This text is [superscript]superscript[/superscript]. Interesting...
fr: Ce texte est en [superscript]exposant[/superscript]. Intéressant...

source: Subscript
fr: Sous-exposant

source: This text is [subscript]subscript[/subscript]. Interesting...
fr: Ce texte est en [subscript]subscript[/subscript]. Intéressant...

source: Wiki insertion
fr: Insertion wiki

source: This text ++has been inserted++.
fr: Ce texte a ++été inséré++.

source: Inserted
fr: Inséré

source: This text [inserted]has been inserted[/inserted].
fr: Ce texte a [inserted]été inséré[/inserted].

source: Wiki deletion
fr: Suppression wiki

source: This text --has been deleted--.
fr: Ce texte a --été supprimé--.

source: Deleted
fr: Supprimé

source: This text [deleted]has been deleted[/deleted].
fr: Ce texte a [deleted]été supprimé[/deleted].

source: Flag
fr: Drapeau

source: [flag]important![/flag] Don't forget to give something to your cat today.
fr: [flag]important![/flag] N'oubliez pas de donner quelque chose à votre chat aujourd'hui.

source: This text is in Serif.
fr: Ce texte est en écriture Serif.

source: This text is in Sans-Serif.
fr: Ce texte est en écriture Sans-Serif.

source: This text is in Cursive.
fr: Ce texte est en écriture Cursive.

source: This text is in Fantasy.
fr: Ce texte est en écriture Fantasy.

source: This text is in Comic.
fr: Ce texte est en écriture Comic.

source: Use any style
fr: Utiliser un style

source: But where will this rabbit be in some minutes? I don't know, but it depends also on the turtle speed...
fr: Mais où sera ce lapin dans quelques minutes ? Je ne sais pas, mais ça dépendra aussi de la vitesse de la tortue...

source: Please note that actual rendering depends on the selected %s.
fr: Bien entendu, le rendu visuel dépend du %s choisi pour l'affichage

source: skin
fr: style

source: Help
fr: Aide

source: Codes to format blocks
fr: Formattage de blocs

source: But where will this rabbit be in some minutes?[nl]I don't know, but it depends also on the turtle speed...
fr: Mais où sera ce lapin dans quelques minutes ? [nl]Je ne sais pas, mais ça dépendra aussi de la vitesse de la tortue..

source: Center
fr: Centrage

source: Right
fr: Alignement à droite

source: Decorated
fr: Décoré

source: Caution
fr: Attention

source: PHP snippet
fr: Code PHP

source: A snippet of load_skin(), from global.php:
fr: Un extrait de load_skin(), pris dans global.php :

source: Pre-formatted
fr: Pré-formatté

source: Let assume a standard HTTP request to get it, such as the next one, which has 382 bytes:
fr: Observons par exemple la requête HTTP suivante, qui a 382 octets :

source: Quote
fr: Citer

source: Folded
fr: Plié

source: Folded with title
fr: Plié avec titre

source: A Rabbit Story
fr: Fable de La Fontaine

source: Unfolded
fr: Déplié

source: Unfolded with title
fr: Déplié avec titre

source: Sidebar
fr: Boîte de côté

source: Sidebar with title
fr: Boîte de côté avec titre

source: Scroller
fr: Défilement

source: Play in a separate window
fr: Jouer dans une fenêtre séparée

source: %d named person has followed the link: %s
fr: %d personne identifiée a suivi le lien : %s

source: No authenticated person has used this link yet
fr: Aucune personne authentifiés n'a encore utilisé ce lien

source: View this comment
fr: Voir ce commentaire

source: [this file has been deleted]
fr: [ce fichier à été supprimé]

source: [this file has been replaced]
fr: [ce fichier à été remplacé]

source: redirection to unknown reference : %s
fr: redirection vers une référence inconnue : %s

source: %d active now
fr: %d actif maintenant

source: ERROR: Impossible to write to the file %s. The configuration has not been saved.
fr: Erreur: Impossible d'écrire dans le fichier %s. La configuration n'a pas été sauvegardée

source: Codes test
fr: Test des codes

source: Input message has %d bytes
fr: Le message d'entrée a %d caractères

source: %d records have been processed
fr: %d enregistrements ont été traités

source: Script terminated in %.2f seconds.
fr: Script terminé en %.2f secondes.

source: Filter
fr: Filtre

source: Introduction to formatting codes
fr: Présentation des codes de contrôle

source: In-line formatting codes (bold, underlined, ...)
fr: Formattage de caractères (gras, italique...)

source: Links (and shortcuts, buttons, ...)
fr: Liens (et raccourcis, boutons...)

source: Lists (with bullets, numbered, ...)
fr: Listes (à puces, numérotées...)

source: Blocks (indentation, script, quote, ...)
fr: Blocs (indentation, script, citation...)

source: Tables (with headers, with grids, use CSV data, ...)
fr: Tables (avec en-têtes, à grille, import CSV...)

source: Titles and questions (and table of content)
fr: Titres et question (et table des matières)

source: Dynamic queries (updates, content, ...)
fr: Requêtes dynamiques (mises à jour, contenu, ...)

source: Widgets (twitter, calendar, ...)
fr: Widgets (twitter, calendrier, ...)

source: Miscellaneous codes (charts, ...)
fr: Codes divers (graphiques...)

source: Codes allow you to specify formatting rules for your text, even if you are not allowed to use HTML in your posts. BB codes, or UBB codes, originated from the forum software named PHPBB, and YACS has a special implementation of it.
fr: Les codes vous permettent de modifier le rendu visuel du texte même si vous n'êtes pas autorisé(e) à utiliser HTML. Les BB codes, ou UBB codes, sont apparus avec le logiciel PHPBB, et YACS en a une implémentation étendue.

source: With codes you use "tags" to add formatting to your text. Every tag is enclosed in [ and ]. If you want to mark some region in your text, you need to use an opening tag and a closing tag. Closing tags start with [/, as you will see in the examples at the next pages. If you mistype a tag or forget to close it, you will not get the desired formatting.
fr: Avec les codes vous utilisez des "balises" de formattage de votre texte. Chaque balise doit être placée entre les caractères [ et ]. Chaque région particulière de votre texte sera marquée d'une balise d'ouverture et de fermeture. Les balises de fermeture commencent par la séquence [/ , comme le montrent les exemples des pages suivantes. Si vous vous trompez de balise ou oubliez la fermeture, le rendu visuel ne sera pas celui attendu.

source: Follow the links below to get more information on codes implemented on this server.
fr: Suivez les liens ci-dessous pour obtenir plus d'information sur les codes implémentés sur ce serveur.

source: You can also browse links above in complement to the %s.
fr: Vous pouvez aussi naviguer sur les liens ci-dessus en complément de %s.

source: Theme test
fr: Test de thème

source: Codes to format links
fr: Codes de formattage des liens

source: Various methods are presented to link your pages to others.
fr: Présentation des nombreuses possibilités de liaison de vos pages vers d'autres.

source: External link
fr: Lien externe

source: You can visit www.cisco.com or http://www.nortel.com, or have a chat at irc://irc.eu.be.ofloo.net/
fr: Vous pouvez visiter www.cisco.com ou http://www.nortel.com, ou discuter à irc://irc.eu.be.ofloo.net/

source: You can visit [link]www.cisco.com[/link] or [link]http://www.nortel.com[/link], or have a chat at [link]irc://irc.eu.be.ofloo.net/[/link]
fr: Vous pouvez visiter [link]www.cisco.com[/link] ou [link]http://www.nortel.com[/link], ou discuter à [link]irc://irc.eu.be.ofloo.net/[/link]

source: YouTube link
fr: Lien YouTube

source: Internal link
fr: Lien interne

source: You can visit [link]codes/basic.php[/link] or [link]index.php[/link]
fr: Vous pouvez visiter [link]codes/basic.php[/link] ou [link]index.php[/link]

source: Labelled link
fr: Lien avec label

source: You can visit [Cisco On Line|www.cisco.com]
fr: Vous pouvez visiter [Cisco On Line|www.cisco.com]

source: You can visit [link=Cisco On Line]www.cisco.com[/link]
fr: Vous pouvez visiter [link=Cisco On Line]www.cisco.com[/link]

source: Labelled button
fr: Bouton avec label

source: You can visit [button=Cisco On Line|www.cisco.com]
fr: Vous pouvez visiter [button=Cisco On Line|www.cisco.com]

source: Member clicks
fr: Clics des membres

source: You can visit [click=Cisco On Line|http://www.cisco.com] [folded][clicks=http://www.cisco.com][/folded]
fr: Vous pouvez visiter [click=Cisco On Line|http://www.cisco.com] [folded][clicks=http://www.cisco.com][/folded]

source: e-mail address
fr: Adresse électronique

source: You can send a message at webmaster@acme.com
fr: Vous pouvez envoyer un message à l'adresse suivante : webmaster@acme.com

source: You can send a message at [email]webmaster@acme.com[/email]
fr: Vous pouvez envoyer un message à l'adresse suivante : [email]webmaster@acme.com[/email]

source: Labelled e-mail address
fr: Adresse avec label

source: You can send a message to our [email=support team]webmaster@acme.com[/email]
fr: Vous pouvez envoyer un message à l'[email=équipe de support]webmaster@acme.com[/email]

source: Selector
fr: Sélecteur

source: Please use our [go=monthly, monthly archive] for reference
fr: Merci de consulter les [go=monthly, archives mensuelles] pour plus d'information

source: Please use our [[monthly, monthly archive]] for reference
fr: Merci de consulter les [[monthly, archives mensuelles]] pour plus d'information

source: Page shortcut
fr: Raccourci de page

source: Have a look at %s
fr: Jetez un coup d'oeil à %s

source: Previous page
fr: Page précédente

source: Next page
fr: Page suivante

source: Random
fr: Aléatoire

source: Section shortcut
fr: Section

source: Category shortcut
fr: Catégorie

source: Category
fr: Catégorie

source: User shortcut
fr: Utilisateur

source: Server shortcut
fr: Serveur

source: Click to view the page of [server=2, this server]
fr: Cliquez pour voir la page de [serveur=2, ce serveur]

source: File shortcut
fr: Fichier

source: Download shortcut
fr: Raccourci de téléchargement

source: Click to %s
fr: Cliquer pour %s

source: download the file
fr: télécharger le fichier

source: Action shortcut
fr: Action

source: Click to view the page of [action=2, this action]
fr: Cliquez pour voir la page de [action=2, cette action]

source: Comment shortcut
fr: Commentaire

source: Click to view the page of [comment=2, this comment]
fr: Cliquez pour voir la page de [comment=2, ce commentaire]

source: Script shortcut
fr: Script

source: You can access the documentation for the script [script]shared/codes.php[/script]
fr: Vous pouvez consulter la documentation du script [script]shared/codes.php[/script]

source: Search
fr: Recherche

source: All you want to know on [search=yacs]
fr: Chercher toutes les informations sur [search=yacs]

source: All you want to know on [wikipedia=Web_2, the web 2.0]
fr: Tout ce que vous voulez savoir sur [wikipedia=Web_2, le web 2.0]

source: Codes to format lists
fr: Construction de listes

source: List item
fr: Elément de liste

source: A simple list:
fr: Une liste simple :

source: First item
fr: Premier élément

source: Second item (after one empty line)
fr: Deuxième élément

source: Third item (next the previous one)
fr: Troisième élément

source: Bulleted list
fr: Liste à points

source: A list with bulleted items:
fr: Une liste à points :

source: Second item
fr: Deuxième élément

source: Numbered list
fr: Liste numérotée

source: A list with numbered items:
fr: Une liste numérotée :

source: A list with alphabetically numbered items:
fr: Une liste utilisant l'alphabet :

source: Another list with alphabetically numbered items:
fr: Une autre liste utilisant l'alphabet :

source: A list with roman numbers:
fr: Une liste à chiffres romains :

source: Another list with roman numbers:
fr: Une autre liste à chiffres romains :

source: Live codes
fr: Codes dynamiques

source: On this page we are introducing codes related to dynamic queries of site content.
fr: Cette page présente certains codes de contrôles ainsi que des exemples d'utilisation.

source: Assigned sections
fr: Sections assignées

source: Categories
fr: Catégories

source: Assigned categories
fr: Catégories assignées

source: Recent pages
fr: Pages récentes

source: Use the simplest form to display a compact list of pages, or limit the scope.
fr: Utilisez la forme simple pour visualiser une liste compacte de pages, ou la forme plus complexe pour limiter la recherche.

source: Personal pages
fr: Pages personnelles

source: Recent updates
fr: Mises à jour récentes

source: Personal updates
fr: Mises à jour personnelles

source: Hall of fame
fr: Pages les plus lues

source: Personal hits
fr: Succès personnels

source: Present users
fr: Personnes présentes

source: Miscellaneous codes
fr: Codes divers

source: Implicit formatting
fr: Formattage implicite

source: hello
fr: bonjour

source: world
fr: le monde

source: how are
fr: comment ça

source: you doing?
fr: va aujourd'hui ?

source: one bulleted item
fr: un élément à puce

source: another one
fr: un autre

source: quoted from
fr: cité d'un message

source: a previous message
fr: précédent

source: Hint
fr: Information contextuelle

source: YACS is based on international standards, including [hint=eXtended Markup Language]XML[/hint].
fr: YACS s'appuye sur des standards internationaux, tels que [hint=eXtended Markup Language]XML[/hint].

source: Newline
fr: Saut de ligne ("newligne" en anglais)

source: Ruler
fr: Séparation

source: But where will this rabbit be in some minutes?[---]I don't know, but it depends also on the turtle speed...
fr: Mais où sera ce lapin dans quelques minutes ?[---]Je ne sais pas, mais ça dépendra aussi de la vitesse de la tortue...

source: New
fr: Nouveau

source: Our newsletter has been published!
fr: Notre lettre d'information est parue !

source: Popular
fr: Populaire

source: Numerous surfers like this section of our site
fr: Cette section est prisée par de nombreux internautes

source: Flags
fr: Drapeaux

source: Static chart
fr: Graphique fixe

source: Execute a local script
fr: Exécuter un script local

source: Redirect to a local address
fr: Rediriger vers une adresse locale

source: Display some parameter
fr: Afficher un paramètre

source: Prevent code interpretation
fr: Empêcher l'interprétation des codes

source: Displayed only to anonymous surfers
fr: Visible seulement pour les surfeurs anonymes

source: Displayed only to authenticated surfers
fr: Visible seulement pour les surfeurs authentifiés

source: Displayed only to associates
fr: Visible seulement pour les associés

source: Codes to format tables
fr: Construction de tables

source: On this page we are showing how to build simple tables. Use the char |, or tab, or two successive spaces, to separate column elements.
fr: Cette page montre comment construire des tables simples, à raison d'une ligne de texte par ligne de table. Utilisez le caractère |, ou une tabulation, ou un double espace, pour séparer les données de chaque colonne.

source: In this example cells are separated by tabulation characters or by 2 spaces.
fr: Dans cet exemple, les cellules sont séparées par des caractères de tabulation, ou par des espaces doublés.

source: Rabbit
fr: Lapin

source: Turtle
fr: Tortue

source: Stories
fr: Fables

source: In this example cells are separated by the | character.
fr: Dans cet exemple, les cellules sont séparées le caractère |.

source: Rabbit|Turtle
fr: Lapin|Tortue

source: Stories|Jean[nl]de la Fontaine
fr: Fables|Jean[nl]de la Fontaine

source: Separate headers from the body
fr: Séparation du corps

source: First Name|Last Name
fr: Prénom|Nom

source: Explicit cells alignment
fr: Alignement explicite

source: Full Name
fr: Nom complet

source: Birth Year
fr: Naissance

source: Net income
fr: Revenus net

source: Comma-separated values
fr: Données importées

source: Net income for the year,$2.310
fr: Revenus de cette année, $2.310

source: Net income for last year,$2.100
fr: Revenus de l'année dernière, $2.100

source: Net income increase,10%
fr: Augmentation de revenus, 10%

source: Using a different separator between cells.
fr: Utilisation d'un séparateur spécifique entre les cellules.

source: Net income for the year;$2.310
fr: Revenus de cette année;$2.310

source: Net income for last year;$2.100
fr: Revenus de l'année dernière;$2.100

source: Net income increase;10%
fr: Augmentation de revenus;10%

source: Codes to format titles and questions
fr: Codes pour formattage de titres et de questions

source: On this page we are showing how to add headlines, questions, and related table of contents.
fr: Cette page montre comment ajouter des titres, des questions, ainsi que les tables récapitulatives correspondantes.

source: Table of content
fr: Table des matières

source: Title
fr: Titre

source: Rabbit and Turtle
fr: Et alors le lapin...

source: Subtitle
fr: Sous-titre

source: Header level 1
fr: Titre niveau 1

source: Header level 2
fr: Titre niveau 2

source: Header level 3
fr: Titre niveau 3

source: Header level 4
fr: Titre niveau 4

source: Header level 5
fr: Titre niveau 5

source: Table of Questions
fr: Liste de questions

source: Question-title
fr: Question-titre

source: But where will this rabbit be in some minutes?
fr: Mais où sera ce lapin dans quelques minutes ?

source: But where is this rabbit right now?
fr: Mais où est donc passée Mirza ?

source: Answer
fr: Réponse

source: I do not know, but it depends also on the turtle speed...
fr: Je ne sais pas, mais ça dépendra aussi de la vitesse de la tortue aussi...

source: On this page we are introducing codes related to widgets and badges.
fr: Cette page présente certains codes de contrôles ainsi que des exemples d'utilisation.

source: Newsfeed
fr: Fil de nouvelles

source: Twitter profile
fr: Profil Twitter

source: Twitter search
fr: Recherche Twitter

source: External page
fr: Pages externe

source: Cloud of tags
fr: Nuage d'étiquettes

source: Use the parameter to adjust the number of tags listed.
fr: Utiliser le paramètre pour ajuster le nombre d'étiquettes.

source: Events
fr: Evénements

source: Direct location
fr: Emplacement direct
